#pragma once
#include <iostream>
#include <fstream>
#include <sstream>
#include <vector>
#include <string>
using namespace std;




enum main
{
	M_genr, M_singer, M_titel, M_totallist
};
enum genr1
{

	ballad, hiphop, 트로트, dance,


};

enum singer1
{
	AAA, BBB, CCC, DDD, EEE, FFF, GGG, HHH, III
};


























//가수
//1아이유
//2에스지
//3 워너비
//4성시경
//5규현
//6씨야
//7 하동균
//8정은지
//9 린
//
//10윤하
//11이적
//12김동률
//13오혁
//14에일리
//15장윤정
//16진성
//17조용필
//18장민호
//19윤수현
//20진미령
//21신유
//22조항조
//23심수봉
//24서경주
//25프리스타일
//26 싸이
//27리쌍
//28산이
//29프라이머리
//30엠씨몽
//31다이나믹듀오
//32거북이
//33  2NE1
//34 빅뱅
//35여자친구
//36코요태
//37씨스타
//38한동근


//발라드
//아이유 내손을 잡아, 봄 사랑 벚꽃 말고, 금요일에 만나요, 너의 의미 4
//sg워너비 timeless, 라라라, 살다가, 죄와벌 4
//성시경 희재, 거리에서, 내게 오는 길  4
//규현 광화문에서   1
//씨야 사랑의 인사  1
//하동균 그녀를 사랑해줘요  1
//정은지 All For You  1
//린 사랑했잖아   1
//윤하 기다리다   1
//이적 걱정말아요 그대  1
//김동룔 다시 사랑한다 말할까  1
//오혁 소녀  1

//
//트로트
//장윤정 초혼, 사랑아, 꽃, 짠자라, 불나비, 첫사랑, 어부바, 올래, 트위스트  9
//진성 안동역에서, 보릿고게, 태클을 걸지마  3
//조용필 바람의 노래, 단발머리  2
//장민호 남자는 말합니다  1
//윤수현 천태만상 1
//진미령 미운 사랑 1
//신유 시계바늘 1 
//조항조 거짓말, 남자라는 이유로  2
//심수봉 백만송이 장미  1
//서경주 당돌한 여자   1
//
//힙합
//프리스타일 Y, 수취인 불명  2
//싸이 어땠을까, 뜨거운 안녕, 예술이야, 강남스타일  4
//리쌍 헤어지지 못하는 여자, 떠나기지 못하는 남자, 발레리노, 광대, 눈물  4
//SanE 한여름밤의 꿀  1
//프라이머리 자니, 씨스루, 물음표  3
//MC몽 I Love U Oh Thank U, 죽을만큼 아파서, 내 생애 가장 행복한 시간  3
//다이나믹 듀오 죽일놈, 고백  2
// 
//댄스
//거북이 비행기, 빙고  2
//아이유 미리 메리 크리스마스, 좋은날, 너랑나, 스물셋, 하루 끝, 분홍신  6
//2NE1 I Don't Care , Go Away  2
//빅뱅 붉은 노을, FANTASTIC BABY, 거짓말   3
//여자친구 오늘부터 우리는   1
//코요태 순정, 실연   2
//씨스타 러빙유, SHAKE IT  2
//
//
//클래식
//
//
//재즈

